{
  "title": "About Us",
  "description": "Learn about our mission, team, and the science behind our brain training platform",
  "heroText": "We are dedicated to helping people of all ages improve their cognitive abilities through science-based brain training games.",

  "missionTitle": "Our Mission & Vision",
  "missionHeading": "Our Mission",
  "missionText": "To provide accessible, scientifically-validated brain training tools that help people reach their cognitive potential and maintain mental sharpness throughout their lives.",
  "visionHeading": "Our Vision",
  "visionText": "A world where everyone can access effective tools to train their brain, enhance cognitive abilities, and maintain mental wellbeing regardless of age or background.",

  "storyTitle": "Our Story",
  "storyPara1": "Brain Trainer began in 2022 when a team of cognitive scientists, game developers, and education specialists came together with a shared goal: to create engaging, effective brain training tools based on scientific research.",
  "storyPara2": "We recognized that while many brain training applications existed, few combined scientific rigor with genuinely enjoyable gameplay. We set out to bridge this gap by developing exercises that are both fun to play and scientifically validated.",
  "storyPara3": "Today, our platform offers multiple cognitive training categories with dozens of games designed to target specific cognitive functions while providing an enjoyable user experience. We continue to expand our offerings and refine our approach based on the latest research in cognitive science.",
  "storyImageAlt": "Our team collaboration meeting",

  "scienceTitle": "The Science Behind Our Platform",
  "sciencePara1": "Our training games are developed based on peer-reviewed research in cognitive science, neuroscience, and educational psychology. We collaborate with leading researchers to ensure our approach is aligned with current scientific understanding.",
  "scienceStat1": "Research Studies",
  "scienceStat2": "User Improvement",
  "scienceStat3": "Scientific References",
  "sciencePara2": "Each of our cognitive training exercises is designed to target specific neural pathways associated with cognitive functions like memory, attention, and problem-solving. Through consistent training, these neural connections are strengthened, potentially leading to improved cognitive performance in daily life.",

  "teamTitle": "Our Team",
  "teamDescription": "Meet the passionate experts behind Brain Trainer",
  "team1Name": "Dr. Emily Chen",
  "team1Title": "Founder & Cognitive Scientist",
  "team1Bio": "With a Ph.D. in Cognitive Neuroscience from Stanford University, Emily has dedicated her career to understanding how the brain learns and adapts. She leads our research efforts and ensures all our training exercises are scientifically sound.",
  "team2Name": "Michael Rodriguez",
  "team2Title": "Game Design Director",
  "team2Bio": "Michael brings 15 years of experience in game design and development. He ensures our cognitive exercises are not only effective but also engaging and enjoyable for users of all ages.",
  "team3Name": "Sarah Johnson",
  "team3Title": "Educational Psychology Specialist",
  "team3Bio": "With a background in educational psychology, Sarah helps design personalized learning paths and ensures our platform accommodates diverse learning styles and abilities.",
  "team4Name": "David Kim",
  "team4Title": "Chief Technology Officer",
  "team4Bio": "David leads our development team, combining his expertise in software engineering with a passion for creating accessible tools that improve cognitive function.",

  "contactTitle": "Contact Us",
  "contactDescription": "Have questions or feedback? We'd love to hear from you!",
  "emailHeading": "Email Us",
  "phoneHeading": "Call Us",
  "addressHeading": "Visit Us",
  "formName": "Your Name",
  "formNamePlaceholder": "Enter your full name",
  "formEmail": "Your Email",
  "formEmailPlaceholder": "Enter your email address",
  "formSubject": "Subject",
  "formSubjectPlaceholder": "What is this about?",
  "formMessage": "Message",
  "formMessagePlaceholder": "Type your message here...",
  "formSubmit": "Send Message"
} 